app/controllers/api/v1/books_controller.rb

SELECT "book_images".* FROM "book_images"
---
  def create
    book = Book.create!(stings_data_params)
    if book
      if params[:images].present?