app/controllers/api/v1/books_controller.rb

SELECT "book_images".* FROM "book_images"
INSERT INTO "book_images" ("book_id", "image_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["book_id", 4], ["image_id", 4], ["created_at", "2022-06-27 12:04:41.196845"], ["updated_at", "2022-06-27 12:04:41.196845"]]
INSERT INTO "images" ("src", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["src", "hfuajldksnalk"], ["created_at", "2022-06-27 12:02:05.089635"], ["updated_at", "2022-06-27 12:02:05.089635"]]
INSERT INTO "books" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "aaaaa"], ["created_at", "2022-06-27 12:02:05.075074"], ["updated_at", "2022-06-27 12:02:05.075074"]]
---
  def index
    output = []

    all_books = Book.includes(:images)
    all_books.each do | book |
      book_src = book.images.pluck(:src)
      object =
      { id: book.id,
        title: book.title,
        author: book.author,
        body: book.body,
        created_at: book.created_at,
        imageUrl: book_src }

INSERT INTO "books" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "aaaaa"], ["created_at", "2022-06-27 12:01:55.776403"], ["updated_at", "2022-06-27 12:01:55.776403"]]
INSERT INTO "book_images" ("book_id", "image_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["book_id", 4], ["image_id", 4], ["created_at", "2022-06-27 12:04:41.196845"], ["updated_at", "2022-06-27 12:04:41.196845"]]
INSERT INTO "images" ("src", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["src", "hfuajldksnalk"], ["created_at", "2022-06-27 12:01:55.833638"], ["updated_at", "2022-06-27 12:01:55.833638"]]
---
  def create

    binding.pry

    book = Book.create!(book_params)

    if book
      image = Image.create!(book_id: book.id, src: params[:images][0][:path])