app/controllers/api/v1/registrations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "uwk0NavFKse6xMpnFVtQ8ugwjRf2"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "長崎豊"], ["email", "fran.seagal1@gmail.com"], ["uid", "uwk0NavFKse6xMpnFVtQ8ugwjRf2"], ["created_at", "2022-06-22 10:43:44.728130"], ["updated_at", "2022-06-22 10:43:44.728130"]]
---
  def create
    raise ArgumentError, 'BadRequest Parameter' if payload.blank?
    user = User.find_by(uid: payload['user_id'])
    if user == nil
      user = User.create!(sign_up_params)